<?php
	$arr['gen'] = array('name'=>'ทั่วไป'
		,'child'=>array(
			array('SITE_NAME','Site Name','Test Project'),
			array('CPR','สงวนลิขสิทธิ์','สงวนลิขสิทธิ์'),
			array('LOAD','Loading Text','กรุณารอสักครู่ ระบบกำลังดำเนินการ...'),
			array('ADDR','ที่อยู่','ที่อยู่'),
			array('PHONE','โทรศัพท์','โทรศัพท์'),
			array('MOBILE','มือถือ','มือถือ'),
			array('SIGN_IN','เข้าระบบ','เข้าระบบ'),
			array('USR','อีเมล์','อีเมล์'),
			array('PWD','รหัสผ่าน','รหัสผ่าน'),
			array('WELCOME','ยินดีต้อนรับ','ยินดีต้อนรับ'),
			array('WRONG_USR_INFO','ข้อมูลที่ใช้เข้าระบบไม่ถูกต้อง','ข้อมูลที่ใช้เข้าระบบไม่ถูกต้อง'),
			array('SIGN_OUT','ออกจากระบบ','ออกจากระบบ'),
			array('R_ALL','อ่านทั้งหมด','อ่านทั้งหมด'),
			array('GET_MORE','โหลดข้อมูลเพิ่ม','ข้อมูลก่อนหน้านี้')
		)
	);
	
	$arr['form'] = array('name'=>'แบบฟอร์ม'
		,'child'=>array(
			array('PER_INFO','ข้อมูลส่วนตัว','ข้อมูลส่วนตัว'),
			array('FNAME','ชื่อ','ชื่อ'),
			array('LNAME','นามสกุล','นามสกุล'),
			array('ADDR','ที่อยู่','ที่อยู่'),
			array('PROV','จังหวัด','จังหวัด'),
			array('POST_CODE','รหัสไปรษณีย์','รหัสไปรษณีย์'),
			array('MAIL','อีเมล์','อีเมล์'),
			array('CF_MAIL','ยืนยันอีเมล์','ยืนยันอีเมล์'),
			array('TOPIC','หัวข้อ','หัวข้อ'),
			array('CMT','ข้อความ','ข้อความ'),
			array('CF_PWD','ยืนยันรหัสผ่าน','ยืนยันรหัสผ่าน'),
			array('NPWD','รหัสผ่านใหม่','รหัสผ่านใหม่'),
			array('CF_NPWD','ยืนยันรหัสผ่านใหม่','ยืนยันรหัสผ่านใหม่'),
			array('REQ','กรุณาระบุข้อมูล','กรุณาระบุข้อมูล'),		
			array('VALID_CODE', 'รหัสตรวจสอบ','รหัสตรวจสอบ'),
			array('TERM','เงื่อนไขการสมัครสมาชิก','เงื่อนไขการสมัครสมาชิก'),
			array('TERM_TXT','ยอมรับข้อตกลง','ยอมรับข้อตกลง'),
			array('REGEN','เปลี่ยนรหัสตรวจสอบ','เปลี่ยนรหัสตรวจสอบ'),
			array('CT_SJ','หัวข้ออีเมล์แบบฟอร์ม','มีข้อความมาจาก '.SITE_NAME),
			array('CT_MSG','รายละเอียดข้อความ','รายละเอียดข้อความจาก '.SITE_NAME),
			array('COMP_CT_SEND','ข้อความแจ้งว่าส่งข้อมูลเรียบร้อยแล้ว','ได้ส่งข้อความเรียบร้อยแล้ว'),
			array('COMP_WB_TP_ADD','ข้อความแจ้งว่าได้เพิ่มหัวข้อกระทู้ใหม่เรียบร้อยแล้ว','ได้เพิ่มหัวข้อกระทู้ใหม่เรียบร้อยแล้ว'),
			array('COMP_ADD','จัดเก็บข้อมูลเรียบร้อย','จัดเก็บข้อมูลเรียบร้อยแล้ว'),
			array('COMP_UD','แก้ไขข้อมูลเรียบร้อย','แก้ไขข้อมูลเรียบร้อยแล้ว'),
			array('ERR_MAIL_FM', 'รูปแบบอีเมล์ไม่ถูกต้อง','รูปแบบอีเมล์ไม่ถูกต้อง'),
			array('ERR_MAIL_NOT_MATCH','กรอกอีเมล์ไม่เหมือนกัน','กรุณาระบุอีเมล์ทั้งสองให้ตรงกัน'),
			array('ERR_REQ','กรุณาระบุข้อมูล','กรุณาระบุข้อมูล'),
			array('ERR_ALL_REQ','กรุณากรอกข้อมูลให้ครบถ้วน','กรุณากรอกข้อมูลให้ครบถ้วน'),
			array('ERR_PWD_LENGTH','ความยาวรหัสผ่านไม่ถูกต้อง','กรุณาระบุรหัสผ่านความยาวมากกว่า 6 ตัวอักษร'),
			array('ERR_PASS_NOT_MATCH','รหัสผ่านไม่เหมือนกัน','กรุณาระบุรหัสผ่านทั้งสองให้ตรงกัน'),
			array('ERR_CAPT','รหัสตรวจสอบไม่ถูกต้อง','รหัสตรวจสอบไม่ถูกต้อง')
		)
	);
	
	$arr['misc'] = array('name'=>'อื่นๆ'
		,'child'=>array(
			array('PLS_SLT','กรุณาเลือก','กรุณาเลือก'),
			array('B_SEND','ปุ่มยืนยันข้อมูล','ยืนยัน'),
			array('B_CLO','ปุ่มปิดหน้าเว็บ','ปิดหน้านี้'),
			array('SRC_N','แสดงแหล่งข้อมูลที่นำมาแสดง','ขอบคุณข้อมูลจาก')
		)
	);

	$arr['notfound'] = array('name'=>'Page Not Found'
		,'child'=>array(
			array('PNF_TOPIC','หัวข้อในหน้าไม่พบหน้าที่ต้องการ','ไม่พบหน้าที่ต้องการ'),
			array('PNF_CONTENT','เนื้อหาในหน้าไม่พบหน้าที่ต้องการ','ไม่พบหน้าที่ต้องการ อาจจะเพราะว่าหน้านี้ไม่มีการใช้งานแล้ว หรือคุณอาจพิมพ์ผิด โปรดตรวจสอบความถูกต้องอีกครั้ง')
		)
	);
?>